
  #### Terraform Format and Style 🖌`success`
  #### Terraform Initialization ⚙️`success`
  #### Terraform Validation 🤖`success`
  Validation Output
  ```
  Success! The configuration is valid.


  ```
  #### Terraform Plan 📖`success`
  ```
  google_cloud_run_v2_service.mosq_center: Refreshing state... [id=projects/mosq-center/locations/europe-west1/services/mosq-center]
google_cloud_run_service_iam_member.mosq_center_invoker: Refreshing state... [id=v1/projects/mosq-center/locations/europe-west1/services/mosq-center/roles/run.invoker/allUsers]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place

Terraform will perform the following actions:

  # google_cloud_run_service_iam_member.mosq_qoku_invoker will be created
  + resource "google_cloud_run_service_iam_member" "mosq_qoku_invoker" {
      + etag     = (known after apply)
      + id       = (known after apply)
      + location = "europe-west1"
      + member   = "allUsers"
      + project  = "mosq-center"
      + role     = "roles/run.invoker"
      + service  = "mosq-qoku"
    }

  # google_cloud_run_v2_service.mosq_center will be updated in-place
  ~ resource "google_cloud_run_v2_service" "mosq_center" {
        id                      = "projects/mosq-center/locations/europe-west1/services/mosq-center"
        name                    = "mosq-center"
        # (25 unchanged attributes hidden)

      ~ template {
            # (6 unchanged attributes hidden)

          ~ containers {
              ~ image      = "europe-west1-docker.pkg.dev/mosq-center/mosq-center-docker/mosq-center@sha256:24216f65bd1befb1852af162be30cf4ea9940f70d87f0fbdd4851cdd83049c9a" -> "europe-west1-docker.pkg.dev/mosq-center/mosq-center-docker/mosq-center@sha256:4307ce598edb88cbb3c059e6ae8488973cd244795dcbb7756c213af3682a116b"
                # (3 unchanged attributes hidden)

              + env {
                  + name  = "MONGO_COLLECTION_NAME"
                  + value = "center-mosq"
                }
              + env {
                  + name  = "SERVICE_NAME"
                  + value = "center"
                }

                # (13 unchanged blocks hidden)
            }

            # (2 unchanged blocks hidden)
        }

        # (1 unchanged block hidden)
    }

  # google_cloud_run_v2_service.mosq_qoku will be created
  + resource "google_cloud_run_v2_service" "mosq_qoku" {
      + conditions              = (known after apply)
      + create_time             = (known after apply)
      + creator                 = (known after apply)
      + delete_time             = (known after apply)
      + effective_annotations   = (known after apply)
      + effective_labels        = (known after apply)
      + etag                    = (known after apply)
      + expire_time             = (known after apply)
      + generation              = (known after apply)
      + id                      = (known after apply)
      + ingress                 = (known after apply)
      + last_modifier           = (known after apply)
      + latest_created_revision = (known after apply)
      + latest_ready_revision   = (known after apply)
      + launch_stage            = (known after apply)
      + location                = "europe-west1"
      + name                    = "mosq-qoku"
      + observed_generation     = (known after apply)
      + project                 = "mosq-center"
      + reconciling             = (known after apply)
      + terminal_condition      = (known after apply)
      + terraform_labels        = (known after apply)
      + traffic_statuses        = (known after apply)
      + uid                     = (known after apply)
      + update_time             = (known after apply)
      + uri                     = (known after apply)

      + template {
          + max_instance_request_concurrency = 200
          + service_account                  = (known after apply)
          + timeout                          = "10s"

          + containers {
              + image = "europe-west1-docker.pkg.dev/mosq-center/mosq-center-docker/mosq-center@sha256:4307ce598edb88cbb3c059e6ae8488973cd244795dcbb7756c213af3682a116b"

              + env {
                  + name  = "MONGO_USER_CERT_PATH"
                  + value = "/secrets/user-cert"
                }
              + env {
                  + name  = "ENV"
                  + value = "prod"
                }
              + env {
                  + name  = "AUTH0_ENABLE"
                  + value = "true"
                }
              + env {
                  + name  = "AUTH0_DOMAIN"
                  + value = "mosq-center.eu.auth0.com"
                }
              + env {
                  + name = "AUTH0_CLIENT_ID"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "AUTH0_CLIENT_ID"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name = "AUTH0_CLIENT_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "AUTH0_CLIENT_SECRET"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "AUTH0_CALLBACK_URL"
                  + value = "https://xhamia-qender.com/callback"
                }
              + env {
                  + name = "SESSIONS_SECRET"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "SESSIONS_SECRET"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name = "MONGO_DB_URI"

                  + value_source {
                      + secret_key_ref {
                          + secret  = "MONGO_DB_URI"
                          + version = "1"
                        }
                    }
                }
              + env {
                  + name  = "MONGO_DB_COLLECTION"
                  + value = "center-mosq"
                }
              + env {
                  + name  = "SERVICE_NAME"
                  + value = "qoku"
                }

              + resources {
                  + limits = {
                      + "cpu"    = "1"
                      + "memory" = "512Mi"
                    }
                }

              + volume_mounts {
                  + mount_path = "/secrets"
                  + name       = "mosq-center-secrets"
                }
            }

          + scaling {
              + max_instance_count = 10
              + min_instance_count = 0
            }

          + volumes {
              + name = "mosq-center-secrets"

              + secret {
                  + secret = "user-cert"

                  + items {
                      + mode    = 0
                      + path    = "user-cert"
                      + version = "latest"
                    }
                }
            }
        }

      + traffic {
          + percent = 100
          + type    = "TRAFFIC_TARGET_ALLOCATION_TYPE_LATEST"
        }
    }

Plan: 2 to add, 1 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

  ```
  *Pusher: @SadriShehu, Action: `pull_request`, Working Directory: `infrastructure/gcp/`, Workflow: `pipeline`*
